code-review/NRB_3471_3546/База_Стало/Documents/ВводОстатковЦБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ВводОстатковЦБ</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиЦБДепозитарийМХ</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиЦБМестоРасчетов</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиЦБ</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Комментарий100</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВРегистрОстаткиЦБ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВРегистрОстаткиЦБДепозитарийМХ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВРегистрОстаткиЦБМестоРасчетов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Остатки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Депонент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МестоХранения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазделСчетаДепо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РазделыСчетаДепо</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазделСчетаДепоМХ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РазделыСчетаДепоМХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусЦБ</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыЦБ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетДепо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетДепоМХ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДепоМХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦБ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/AccumulationRegisters/ОстаткиЦБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиЦБ</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СчетДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РазделСчетаДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦБ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДепоМХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепоМХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РазделСчетаДепоМХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепоМХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусЦБ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЦБ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Documents/ВводОстатковЦБ/Forms/ФормаДокумента/Ext/Form/Module.bsl
//#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() Тогда 
		
		УстановитьНомерДокументаСервер();
		ЗаполнитьШапкуДокументаСервер();
				
	КонецЕсли;	
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Оболочки.ПриЧтенииНаСервереДокумента(ЭтотОбъект, ТекущийОбъект);
КонецПроцедуры

//#КонецОбласти

//#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	УстановитьНомерДокументаСервер();
КонецПроцедуры

//#КонецОбласти

//#Область ОбработчикиСобытийЭлементовТаблицыФормыОстатки

&НаКлиенте
Процедура ОстаткиЦБОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка	= Ложь;
	
	ДатаПроверки	= ?(НЕ ЗначениеЗаполнено(Объект.Ссылка), ТекущаяДата(), Объект.Дата);
	
	ЦенныеБумагиКлиент.ЦеннаяБумагаПроверкаВыборка(ВыбранноеЗначение, ДатаПроверки, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиДепонентПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Остатки.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеРеквизитаНаСервере(ТекущаяСтрока.СчетДепо,"Владелец") <> ТекущаяСтрока.Депонент Тогда
		
		ТекущаяСтрока.СчетДепо = ПредопределенноеЗначение("Справочник.СчетаДепо.ПустаяСсылка");
		
	КонецЕсли;
	
	Если ЗначениеРеквизитаНаСервере(ТекущаяСтрока.РазделСчетаДепо,"Владелец") <> ТекущаяСтрока.СчетДепо Тогда
		
		ТекущаяСтрока.РазделСчетаДепо = ПредопределенноеЗначение("Справочник.РазделыСчетаДепо.ПустаяСсылка");
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиСчетДепоПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Остатки.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбщегоНазначения.ЗначениеНеЗаполнено(ТекущаяСтрока.Депонент) Тогда
		
		ТекущаяСтрока.Депонент = ЗначениеРеквизитаНаСервере(ТекущаяСтрока.СчетДепо,"Владелец");
		
	КонецЕсли;
	
	Если ЗначениеРеквизитаНаСервере(ТекущаяСтрока.РазделСчетаДепо,"Владелец") <> ТекущаяСтрока.СчетДепо Тогда
		
		ТекущаяСтрока.РазделСчетаДепо = ПредопределенноеЗначение("Справочник.РазделыСчетаДепо.ПустаяСсылка");
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиРазделСчетаДепоПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Остатки.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если ОбщегоНазначения.ЗначениеНеЗаполнено(ТекущаяСтрока.СчетДепо) Тогда
		
		ТекущаяСтрока.СчетДепо = ЗначениеРеквизитаНаСервере(ТекущаяСтрока.РазделСчетаДепо,"Владелец");
		
	КонецЕсли;
	
	Владелец = ЗначениеРеквизитаНаСервере(ТекущаяСтрока.СчетДепо,"Владелец");
	
	Если ТекущаяСтрока.Депонент <> Владелец Тогда
		
		ТекущаяСтрока.Депонент = Владелец;
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиМестоХраненияПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Остатки.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеРеквизитаНаСервере(ТекущаяСтрока.СчетДепоМХ,"Владелец") <> ТекущаяСтрока.МестоХранения Тогда
		
		ТекущаяСтрока.СчетДепоМХ = ПредопределенноеЗначение("Справочник.СчетаДепоМХ.ПустаяСсылка");
		
	КонецЕсли;
	
	Если ЗначениеРеквизитаНаСервере(ТекущаяСтрока.РазделСчетаДепоМХ,"Владелец") <> ТекущаяСтрока.СчетДепоМХ Тогда
		
		ТекущаяСтрока.РазделСчетаДепоМХ = ПредопределенноеЗначение("Справочник.РазделыСчетаДепоМХ.ПустаяСсылка");
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиСчетДепоМХПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Остатки.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбщегоНазначения.ЗначениеНеЗаполнено(ТекущаяСтрока.МестоХранения) Тогда
		
		ТекущаяСтрока.МестоХранения = ЗначениеРеквизитаНаСервере(ТекущаяСтрока.СчетДепоМХ,"Владелец");
		
	КонецЕсли;
	
	Если ЗначениеРеквизитаНаСервере(ТекущаяСтрока.РазделСчетаДепоМХ,"Владелец") <> ТекущаяСтрока.СчетДепоМХ Тогда
		
		ТекущаяСтрока.РазделСчетаДепоМХ = ПредопределенноеЗначение("Справочник.РазделыСчетаДепоМХ.ПустаяСсылка");
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиРазделСчетаДепоМХПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Остатки.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если ОбщегоНазначения.ЗначениеНеЗаполнено(ТекущаяСтрока.СчетДепоМХ) Тогда
		
		ТекущаяСтрока.СчетДепоМХ = ЗначениеРеквизитаНаСервере(ТекущаяСтрока.РазделСчетаДепоМХ,"Владелец");
		
	КонецЕсли;
	
	Если ТекущаяСтрока.МестоХранения <> ЗначениеРеквизитаНаСервере(ТекущаяСтрока.СчетДепоМХ,"Владелец") Тогда
		
		ТекущаяСтрока.МестоХранения = ЗначениеРеквизитаНаСервере(ТекущаяСтрока.СчетДепоМХ,"Владелец");
		
	КонецЕсли;
	
КонецПроцедуры

//#КонецОбласти

//#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	Если Объект.Остатки.Количество() > 0 Тогда
		ТекстВопроса = "Данные из таблицы документа будут удалены. Продолжить?";
		Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет, 0);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли; 
	КонецЕсли;
	
	ЗаполнитьНаСервере();
КонецПроцедуры

//#КонецОбласти

//#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьШапкуДокументаСервер()
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	ОбщегоНазначения.ЗаполнитьШапкуДокумента(ТекущийОбъект, ПараметрыСеанса.ТекущийПользователь, , );
	ЗначениеВРеквизитФормы(ТекущийОбъект, "Объект");
КонецПроцедуры

&НаСервере
Процедура УстановитьНомерДокументаСервер()
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	Если НЕ ЗначениеЗаполнено(ТекущийОбъект.Дата) Тогда
		ТекущийОбъект.Дата = НачалоДня(ТекущаяДата());
	КонецЕсли;
	ТекущийОбъект.УстановитьНовыйНомер();
	ЗначениеВРеквизитФормы(ТекущийОбъект, "Объект");
КонецПроцедуры



&НаСервереБезКонтекста
Функция ЗначениеРеквизитаНаСервере(Источник, ИмяРеквизита, ПроверятьСуществование = Ложь)
	Перем Результат;
	Если Источник <> Неопределено Тогда
		ЕстьРеквизит = Истина;
		Если ПроверятьСуществование Тогда		
			ЕстьРеквизит = ОбщегоНазначения.ЕстьРеквизитДокумента(
				ИмяРеквизита, Источник.Метаданные());
		КонецЕсли; 
		Если ЕстьРеквизит Тогда
			Результат = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник, ИмяРеквизита);
		КонецЕсли; 		
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОстаткиЦБОстатки.СчетДепо КАК СчетДепо,
	|	ОстаткиЦБОстатки.СчетДепо.Владелец КАК Депонент,
	|	ОстаткиЦБОстатки.РазделСчетаДепо КАК РазделСчетаДепо,
	|	ОстаткиЦБОстатки.ЦБ КАК ЦБ,
	|	ОстаткиЦБОстатки.ЦБ.ISIN КАК ISIN,
	|	ОстаткиЦБОстатки.СчетДепоМХ КАК СчетДепоМХ,
	|	ОстаткиЦБОстатки.РазделСчетаДепоМХ КАК РазделСчетаДепоМХ,
	|	ОстаткиЦБОстатки.СтатусЦБ КАК СтатусЦБ,
	|	ОстаткиЦБОстатки.КоличествоОстаток КАК Количество
	|ИЗ
	|	РегистрНакопления.ОстаткиЦБ.Остатки(&Период, ) КАК ОстаткиЦБОстатки
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОстаткиЦБОстатки.ЦБ.Наименование,
	|	СчетДепо,
	|	РазделСчетаДепо,
	|	СчетДепоМХ,
	|	РазделСчетаДепоМХ,
	|	СтатусЦБ";
	Запрос.УстановитьПараметр("Период", Объект.Дата);
	Объект.Остатки.Загрузить(Запрос.Выполнить().Выгрузить());

КонецПроцедуры



//#КонецОбласти
